<template>
  <div>
    <div class="articlebox">
      <!--<vueLoading v-show="vueload"></vueLoading>
<div class="cont" v-html="phtml">
</div>-->
      <div class="cont">
        <p style="text-align:center">
          <b>
            <span style="font-size:16px">成都IFS VIP微信会员注册/绑定须知</span>
            <br>（请重点关注横线部分）</b>
        </p>
        <p align="left">尊敬的顾客您好！为了更好地为您提供服务、明确您的权利和义务，请在注册/绑定成都IFS会员卡前谨慎阅读、充分理解下述各条款内容，并选择接受或不接受。如果您未满18岁，请在法定监护人的陪同下阅读本协议。 </p>
        <p>
          <u>一、总则 </u>
          <br /> 1.1成都IFS微信服务号的所有权和运营权归成都IFS(以下简称: 成都IFS)所有；
          <br /> 1.2
          <strong>
            <u>用户通过注册/访问，即表示用户与成都IFS之间自动形成协议并接受本协议的约束； </u>
          </strong>
          <br /> 1.3根据相关法律变化及本平台运营需要，成都IFS有权不时更新本使用条款，或不定时于本平台张贴适用于本平台特定区域或特定的事件、活动的附加条款而不另行通知。
          <strong>
            <u>任何对本平台使用条款的变更、更新或修改一经公布于本平台即有效代替原来的协议，建议用户定期查阅。在该等情况下，如用户继续使用本平台的服务的，即表示同意接受经修订的本平台使用条款的约束。本平台的通知、公告、声明等内容是本协议的一部分。
            </u>
          </strong>
        </p>
        <p>
          <u>二、服务内容 </u>
          <br /> 2.1成都IFS微信服务号的具体内容由本平台根据实际情况提供；
          <br /> 2.2本平台仅提供相关的网络服务，除此之外与相关网络服务有关的设备(如个人电脑、手机、及其他与接入互联网或移动网有关的装置)及所需的费用(如为接入互联网而支付的电话费及上网费、为使用移动网而支付的手机费)均应由用户自行负担。
        </p>
        <p align="left">
          <u>三、用户帐号 </u>
          <br /> 3.1经本平台注册系统完成注册程序并通过身份认证的用户即成为正式用户，可以获得本平台规定用户所应享有的一切权限；
          <u>未经认证无法享有本平台规定的部分会员权限，成都IFS有权对会员的权限进行变更；
            <br />
          </u>3.2用户须按照注册要求使用真实姓名及证件号码（身份证、护照、驾驶执照、军官证等）注册。用户有义务保证帐号安全，因用户账号保管不善引起的任何损失，由用户自行承担全部责任，本平台不承担任何责任；如用户发现帐号发送未授权的使用或其他任何安全问题，请通知本平台；
          <br /> 3.3
          <strong>
            <u>用户一经本平台注册、绑定成都IFS会员卡，即视为授权本平台向用户用于注册、绑定成都IFS会员卡的微信账号、手机号码推送会员活动相关信息；</u>
          </strong>
          <br /> 3.4成都IFS会员卡绑定的相关微信账号、手机号码、证件号码及绑定关系的修改，须持会员本人持身份证明文件原件（身份证、护照、驾驶执照、军官证原件等）及更改前后微信至成都IFS礼宾台或VIP贵宾室办理。 </p>
        <p align="left">
          <u>四、会员卡使用</u>
          <br /> 4.1通过本平台申请加入国金会时需保证所填写会员资料内容合法、真实、准确，如有变动，请及时至成都IFS VIP贵宾室更新用户资料；
          <br /> 4.2微信会员卡号二维码为成都IFS会员身份的唯一识别码，若泄露请自行负责；
          <br /> 4.3通过本平台注册、绑定的会员卡仅限成都IFS商场使用；
          <br /> 4.4通过本平台进行会员积分、礼品兑换的，须遵守会员积分、礼品兑换细则，礼品兑换成功获得的领取二维码为唯一领取凭证，须妥善保管，若泄露请自行负责；
          <br /> 4.5会员卡使用细则请以《成都IFSVIP会员手册》为准；
          <br /> 4.6成都IFS享有依法修改《成都IFSVIP会员手册》的权利。 </p>
        <p align="left">
          <u>五、隐私保护</u>
          <br /> 5.1成都IFS承诺：非经法定原因或用户事先许可，成都IFS不会向任何第三方透露用户的非公开信息，但下列情况除外:
          <br /> 1)事先获得用户的明确授权；
          <br /> 2)根据有关的法律法规要求；
          <br /> 3)按照相关政府主管部门的要求；
          <br /> 4)为维护社会公众的利益
          <br /> 5.2
          <strong>
            <u>本平台可能会与第三方合作向用户提供相关的网络服务，在此情况下，如该第三方同意承担与本平台同等的保护用户隐私的责任，则本平台有权将用户的注册资料等提供给该第三方。 </u>
          </strong>
        </p>
        <p align="left">
          <u>六、版权声明</u>
          <br /> 6.1本平台的文字、图片、音频、视频等版权均归成都IFS享有，未经本公司许可不得任意转载；
          <br /> 6.2本平台特有的标识、版面设计、编排方式等版权均属成都IFS享有，未经本平台许可，不得任意复制或转载；
          <br /> 6.3使用本平台的任何内容均应注明&ldquo;来源于成都IFS微信服务号&rdquo;及署上作者姓名，按法律规定需要支付稿酬的，应当通知成都IFS及作者及支付稿酬，并独立承担一切法律责任；
          <br /> 6.4恶意转载本平台内容的，本平台保留将其诉诸法律的权利。 </p>
        <p>
          <u>七、责任声明 </u>
          <br /> 7.1
          <strong>
            <u>用户明确同意其使用成都IFS网络服务所存在的风险及一切后果将完全由用户本人承担，成都IFS对此不承担任何责任； </u>
          </strong>
          <br /> 7.2对于因不可抗力或本平台不能控制的原因造成的网络服务中断或其它缺陷，本平台不承担任何责任，但将尽力减少因此而给用户造成的损失和影响；
          <br /> 7.3对于本平台向用户提供的下列产品或者服务的质量缺陷本身及其引发的任何损失，本平台无需承担任何责任:
          <br /> 1)本平台向用户免费提供的各项网络服务；
          <br /> 2)本平台向用户赠送、兑换的任何产品或者服务。
          <br /> 7.4
          <u>本平台有权于任何时间暂时或永久修改或终止本服务(或其任何部分)，而无论其通知与否，本平台对用户和任何第三人均无需承担任何责任；</u>
          <br /> 7.5本平台不对由于互联网设备正常维护，互联网络连接故障、电力故障、通讯或其他系统的故障、司法行政机关的命令或第三方的不作为而造成的不能或延迟提供平台服务等不可抗力因素承担责任。 </p>
        <u>八、附则</u>
        <br /> 8.1本协议的订立、执行和解释及争议的解决均应适用中华人民共和国法律；
        <br /> 8.2如本协议中的任何条款无论因何种原因完全或部分无效或不具有执行力，本协议的其余条款仍应有效并且存的束力；
        <br /> 8.3成都IFS(成都IFS)有权依法修改本注册协议。
      </div>
      <el-row>
        <el-col :span="12" class="col-01">
          <div class="btn" @click="agree">同意</div>
        </el-col>
        <el-col :span="12">
          <div class="btn" @click="unagree">不同意</div>
        </el-col>
      </el-row>
    </div>
  </div>
</template>
<script>
  import vueLoading from '../components/vueload'
  export default {
    data() {
      return {
        phtml: '',
        vueload: true
      }
    },
    created() {
      if (document.getElementById('appLoading')) {
        document.body.removeChild(document.getElementById('appLoading'))
      }
    },
    components: {
      vueLoading
    },
    mounted() {
     
    },
    methods: {
      agree() {
        sessionStorage.setItem("register_xy", "1")
        this.$router.push({
          name: 'login'
        })
      },
      unagree() {
        WeixinJSBridge.call('closeWindow')
      }
    }
  }

</script>
<style lang="less" rel="stylesheet/less" scoped>
  @import '../../static/css/main.less';
  @import '../../static/css/article.less';
  .cont {
    padding: 10px;
    line-height: 180%;
  }

  .articlebox p {
    line-height: 180%;
  }

  .el-col {
    text-align: center;
  }

  .btn {
    margin: 0px auto;
    .btn_bigyellow(@width: 80%)
  }

</style>
